// ('number' + 3 + 3) = 'number33' //відбувається додавання до строки двох чисел, числа конкатенуються, та додаються до стрінга

// console.log(null + 3) = 3 //null конкатенується до 0, відбувається додавання чисел

 //(5 && "qwerty") = qwerty // якщо обидва значення істинні, то повертає останнє істинне значення( зліва направо, останнє qwerty)

  // (+'40' + +'2' + "hillel")= "42hillel"//спочатку строки конкануються до чисел 40 та 2, а потім конкаються до строки

//('10' - 5 === 6); = false // 10 конканується до числа, 5 строго порівнюється з 6, це false

//(true + false ) = 1 // true = 1, falose = 0, сумма = 1 ;

//('t4px' - 3) = NaN// через віднімання від строки числа отримуємо NaN

//'4' - 3 = 1  // строка конкатенуються до числа, отримуємо віднімання числа від числа
//('6' + 3 ** 0)=61 //спочатку число 3 возводять в 0 ступінь (1), після цього число 1 додається до строки "6"

//12 / '6' = 2 //стока конканується до числа, відбувається ділення

//'10' + (5 === 6) = 10false //5 === 6 це false, бул значення конканується до строки та додається
//(null == '')//= false // null не дорівнює пустій строці

//(3 ** (9 / 3))= 27 // спочатку 9 ділимо на 3, і 3 возводимо в 3 ступінь (27),

//!!'false' == !!'true' //= true //оператор НЕ двічі повторюючись повертається до стартового значення, стрінг !нестрінг !! стрінг, тому тут 2 стрінги і не строге порівняня повертає true

// ('0 || '0' && 1) =1 //спочатку порівнянни 0 або стрінг 0, повертає стрінг "0", а потім оператор або, повертає число 1

//(+null == false) < 1)= false +null = 0, 0 рівен false, тому повертається тру.тру = 1, 1 не менше 1, тому повертає false

//(false && true || true)=true // false&&true повертається перше значення, потім true або false повертається true

//(false && (false || true))=false// в скобках у нас або, тому повертається тру, false&&true повертається перше значення
console.log((+null == false) < 1 ** 5)//= false //в скобках в нас тру +null =0, false = 0, 1 в 7 ступені це 1, 1 не менше 1
